{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<style>.container { width:100% !important; }</style>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "from IPython.core.display import display, HTML\n",
    "display(HTML(\"<style>.container { width:100% !important; }</style>\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 134,
   "metadata": {},
   "outputs": [],
   "source": [
    "%%bash\n",
    "cd currentSubmission\n",
    "rm fqData*tsv || echo \"No fqta.tsv's\"\n",
    "rm sampleData*tsv || echo \"No xenoData.tsv's\"\n",
    "cd .."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 135,
   "metadata": {},
   "outputs": [],
   "source": [
    "def buildEnaSampleSubmissionFile(psDf, xenoDf, fqDf, ena):\n",
    "    adjustHeaderNames(psDf, xenoDf)\n",
    "    sampleData = concatonateSamplesAndSetHeaders(psDf, xenoDf)\n",
    "    tSampleMetaData = transformSampleData(sampleData)\n",
    "    finalSampleMetadata = adjustHeadersToEna(ena, tSampleMetaData)\n",
    "    joinSampleDataAndFastq(finalSampleMetadata,fqDf)\n",
    "    return finalSampleMetadata"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 136,
   "metadata": {},
   "outputs": [],
   "source": [
    "def adjustHeadersToEna(ena, tSampleMetaData):\n",
    "    finalSampleMetadata = tSampleMetaData.reindex(columns=ena.columns)\n",
    "    return finalSampleMetadata\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 137,
   "metadata": {},
   "outputs": [],
   "source": [
    "def joinSampleDataAndFastq(sampleData, fqDf):\n",
    "    fqDf.set_index('sample_alias', inplace=True)\n",
    "    sampleData.set_index('sample_alias', inplace=True)\n",
    "    joinedFqDf = sampleData.merge(fqDf, how='inner', on='sample_alias', sort=True).iloc[:, 19:]\n",
    "    joinedSampleData = joinedFqDf.merge(sampleData, how='inner', on='sample_alias', sort=True).to_csv('./currentSubmission/completedEnaAllSamplesMetadata.tsv', sep='\\t', index=True)\n",
    "    joinedFqDf = joinedFqDf.loc[~joinedFqDf.index.duplicated(keep='last')]\n",
    "    joinedFqDf.to_csv(\"./currentSubmission/matchFastqs.tsv\", sep='\\t', index=True, header=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 138,
   "metadata": {},
   "outputs": [],
   "source": [
    "def transformSampleData(sampleData):\n",
    "    sampleData['sample_title'] = sampleData['mod.sourcePdxId'] + '~' + sampleData['sample unique id'] \\\n",
    "        .replace('\"', '', regex=True)\n",
    "    sampleData['sample_title'].replace('~ ', '~', regex=True, inplace=True)\n",
    "    sampleData['sample_title'].replace('(^[A-Za-z0-9]+)-', '\\\\1~', regex=True, inplace=True)\n",
    "    sampleData['sample_alias'] = sampleData['sample_title']\n",
    "    sampleData.loc[\n",
    "        sampleData['sample_title'].str.contains(\"ORIGINATOR\"), 'engrafted tumor sample passage'] = \"not applicable\"\n",
    "    sampleData['patient tumor type'] = sampleData['patient tumor type'].str.replace('(Primary|Metastatic|Recurrent)','\\\\1 Neoplasm', regex=True)\n",
    "    sampleData['patient tumor type'] = sampleData['patient tumor type'].str.replace('Not Specified', 'not provided',regex=True)\n",
    "    print(sampleData['patient tumor type'])\n",
    "    sampleData['patient age at collection of tumor'] = sampleData['patient age at collection of tumor'].str.replace('Not Specified', 'not provided', regex=True)\n",
    "    sampleData['tax_id'] = '9606'\n",
    "    sampleData['scientific_name'] = 'Homo sapien'\n",
    "    sampleData['common_name'] = 'human'\n",
    "    sampleData['sample material'] = 'tissue fragment'\n",
    "    sampleData['engraftment host strain name'] = 'NOD.Cg-PrkdcscidIl2rgtm1Wjl/SzJ'\n",
    "    sampleData['was the pdx model humanised?'] = 'No'\n",
    "    return sampleData"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 139,
   "metadata": {},
   "outputs": [],
   "source": [
    "def adjustHeaderNames(psDf, xenoDf):\n",
    "    psDf['sample origin'] = \"Patient tumor\"\n",
    "    psDf[' sampleId'] = \"ORIGINATOR\"\n",
    "    xenoDf['sample origin'] = \"Engrafted tumor\"\n",
    "    xenoDf['sample taxon name'] = \"Homo sapiens/Mus musculus xenograft\"\n",
    "    psDf['sample taxon name'] = \"Homo sapiens\"\n",
    "    psDf['passage'] = '0'\n",
    "    xenoDf['engrafted tumor collection site'] = \"Not Specified\"\n",
    "    psDf['engrafted tumor collection site'] = \"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 140,
   "metadata": {},
   "outputs": [],
   "source": [
    "def concatonateSamplesAndSetHeaders(psDf, xenoDf):\n",
    "    sampleData = ps.concat([xenoDf, psDf], sort=True)\n",
    "    emptySampleIds = sampleData[sampleData[' sampleId'] == ''].index\n",
    "    sampleData.drop(emptySampleIds, inplace=True)\n",
    "    sampleData.rename(\n",
    "        columns={\n",
    "            ' passage': 'engrafted tumor sample passage',\n",
    "            ' tt.name': 'patient tumor type',\n",
    "            ' sampleId': 'sample unique id',\n",
    "            'ps.ageAtCollection': 'patient age at collection of tumor',\n",
    "            'ot.name': 'patient age at collection of tumor',\n",
    "            ' originTissue.name': 'patient tumor primary site',\n",
    "            ' sex': 'patient sex',\n",
    "            ' age': 'patient age at collection of tumor',\n",
    "            ' diagnosis': 'patient tumor diagnosis at time of collection',\n",
    "            ' sampleTissue.name': 'patient tumor site of collection'\n",
    "        }, inplace=True)\n",
    "    return sampleData"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {},
   "outputs": [],
   "source": [
    "%%bash\n",
    "#for sample\n",
    "bash -c 'cypher-shell -u neo4j -p neo5j \"MATCH (p:Patient)--(ps:PatientSnapshot)--(psamp:Sample)\n",
    "-[:MODEL_SAMPLE_RELATION]-(mod:ModelCreation)\n",
    "WHERE mod.dataSource = \\\"PDMR\\\"\n",
    "WITH p,ps, psamp, mod\n",
    "MATCH (psamp)--(on:OntologyTerm)\n",
    "OPTIONAL MATCH (psamp)--(tt:TumorType)\n",
    "OPTIONAL MATCH (psamp)-[:SAMPLE_SITE]-(sampleTissue:Tissue)\n",
    "OPTIONAL MATCH (psamp)-[:ORIGIN_TISSUE]-(originTissue:Tissue)\n",
    "return distinct mod.sourcePdxId, psamp.sourceSampleId as sampleId,sampleTissue.name, tt.name, \n",
    "ps.ageAtCollection, on.label as diagnosis, originTissue.name, p.sex as sex, ps.ageAtCollection as age\";' > ./currentSubmission/patientSamples"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "metadata": {},
   "outputs": [],
   "source": [
    "%%bash\n",
    "#for sample\n",
    "bash -c 'cypher-shell -u neo4j -p neo5j \"MATCH (p:Patient)--(ps:PatientSnapshot)--(psamp:Sample)\n",
    "-[:MODEL_SAMPLE_RELATION]-(mod:ModelCreation)\n",
    "WHERE mod.dataSource = \\\"PDMR\\\"\n",
    "WITH p,ps, psamp, mod\n",
    "MATCH (psamp)--(on:OntologyTerm)\n",
    "OPTIONAL MATCH (psamp)--(tt:TumorType)\n",
    "OPTIONAL MATCH (psamp)-[:SAMPLE_SITE]-(sampleTissue:Tissue)\n",
    "OPTIONAL MATCH (psamp)-[:ORIGIN_TISSUE]-(originTissue:Tissue)\n",
    "WITH p,ps, psamp, mod, on, tt, sampleTissue, originTissue\n",
    "MATCH (mod)--(xenoSample:Sample)--(spe:Specimen)\n",
    "RETURN distinct mod.sourcePdxId, xenoSample.sourceSampleId as sampleId, spe.passage as passage,sampleTissue.name,\n",
    "tt.name, ps.ageAtCollection, on.label as diagnosis, originTissue.name, p.sex as sex, ps.ageAtCollection as age\";' > ./currentSubmission/xenoSamples"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 141,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "379 ./currentSubmission/patientSamples\n",
      "1118 ./currentSubmission/xenoSamples\n"
     ]
    }
   ],
   "source": [
    "%%bash\n",
    "wc -l ./currentSubmission/patientSamples\n",
    "wc -l ./currentSubmission/xenoSamples"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 142,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as ps\n",
    "import re"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 143,
   "metadata": {},
   "outputs": [],
   "source": [
    "patientSampleFile = open('./currentSubmission/patientSamples', 'r')\n",
    "xenoSampleFile = open('./currentSubmission/xenoSamples', 'r')\n",
    "fastqMetadata = open('fastqMetadataPdmrRnaSeq_filled.csv', 'r')\n",
    "enaSampleTemplate = open('enaSampleTemplate.csv', 'r')\n",
    "psDf = ps.read_csv(patientSampleFile).replace('\"', '')\n",
    "xenoDf = ps.read_csv(xenoSampleFile).replace('\"', '')\n",
    "fqDf = ps.read_csv(fastqMetadata, sep='\\t').replace('\"','')\n",
    "ena = ps.read_csv(enaSampleTemplate, sep='\\t', header=2).replace('\"','')\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 144,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0          \"Primary Neoplasm\"\n",
      "1          \"Primary Neoplasm\"\n",
      "2          \"Primary Neoplasm\"\n",
      "3          \"Primary Neoplasm\"\n",
      "4       \"Metastatic Neoplasm\"\n",
      "                ...          \n",
      "373        \"Primary Neoplasm\"\n",
      "374        \"Primary Neoplasm\"\n",
      "375        \"Primary Neoplasm\"\n",
      "376        \"Primary Neoplasm\"\n",
      "377     \"Metastatic Neoplasm\"\n",
      "Name: patient tumor type, Length: 1495, dtype: object\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>tax_id</th>\n",
       "      <th>scientific_name</th>\n",
       "      <th>common_name</th>\n",
       "      <th>sample_title</th>\n",
       "      <th>sample_description</th>\n",
       "      <th>sample origin</th>\n",
       "      <th>sample taxon name</th>\n",
       "      <th>sample material</th>\n",
       "      <th>engrafted tumor sample passage</th>\n",
       "      <th>engrafted tumor collection site</th>\n",
       "      <th>patient tumor site of collection</th>\n",
       "      <th>patient tumor type</th>\n",
       "      <th>sample unique id</th>\n",
       "      <th>engraftment host strain name</th>\n",
       "      <th>patient age at collection of tumor</th>\n",
       "      <th>patient tumor diagnosis at time of collection</th>\n",
       "      <th>patient tumor primary site</th>\n",
       "      <th>was the pdx model humanised?</th>\n",
       "      <th>patient sex</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>sample_alias</th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>515863~333-R~A1PPN5</th>\n",
       "      <td>9606</td>\n",
       "      <td>Homo sapien</td>\n",
       "      <td>human</td>\n",
       "      <td>515863~333-R~A1PPN5</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Engrafted tumor</td>\n",
       "      <td>Homo sapiens/Mus musculus xenograft</td>\n",
       "      <td>tissue fragment</td>\n",
       "      <td>\"1\"</td>\n",
       "      <td>Not Specified</td>\n",
       "      <td>\"Not Specified\"</td>\n",
       "      <td>\"Primary Neoplasm\"</td>\n",
       "      <td>\"A1PPN5\"</td>\n",
       "      <td>NOD.Cg-PrkdcscidIl2rgtm1Wjl/SzJ</td>\n",
       "      <td>\"67\"</td>\n",
       "      <td>\"Cutaneous Melanoma\"</td>\n",
       "      <td>\"Skin\"</td>\n",
       "      <td>No</td>\n",
       "      <td>\"Male\"</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>515863~333-R~AYW</th>\n",
       "      <td>9606</td>\n",
       "      <td>Homo sapien</td>\n",
       "      <td>human</td>\n",
       "      <td>515863~333-R~AYW</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Engrafted tumor</td>\n",
       "      <td>Homo sapiens/Mus musculus xenograft</td>\n",
       "      <td>tissue fragment</td>\n",
       "      <td>\"0\"</td>\n",
       "      <td>Not Specified</td>\n",
       "      <td>\"Not Specified\"</td>\n",
       "      <td>\"Primary Neoplasm\"</td>\n",
       "      <td>\"AYW\"</td>\n",
       "      <td>NOD.Cg-PrkdcscidIl2rgtm1Wjl/SzJ</td>\n",
       "      <td>\"67\"</td>\n",
       "      <td>\"Cutaneous Melanoma\"</td>\n",
       "      <td>\"Skin\"</td>\n",
       "      <td>No</td>\n",
       "      <td>\"Male\"</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>918122~036-R~LR0</th>\n",
       "      <td>9606</td>\n",
       "      <td>Homo sapien</td>\n",
       "      <td>human</td>\n",
       "      <td>918122~036-R~LR0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Engrafted tumor</td>\n",
       "      <td>Homo sapiens/Mus musculus xenograft</td>\n",
       "      <td>tissue fragment</td>\n",
       "      <td>\"0\"</td>\n",
       "      <td>Not Specified</td>\n",
       "      <td>\"Not Specified\"</td>\n",
       "      <td>\"Primary Neoplasm\"</td>\n",
       "      <td>\"LR0\"</td>\n",
       "      <td>NOD.Cg-PrkdcscidIl2rgtm1Wjl/SzJ</td>\n",
       "      <td>\"57\"</td>\n",
       "      <td>\"Myxofibrosarcoma\"</td>\n",
       "      <td>\"Musculoskeletal\"</td>\n",
       "      <td>No</td>\n",
       "      <td>\"Male\"</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>918122~036-R~LR2MY8</th>\n",
       "      <td>9606</td>\n",
       "      <td>Homo sapien</td>\n",
       "      <td>human</td>\n",
       "      <td>918122~036-R~LR2MY8</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Engrafted tumor</td>\n",
       "      <td>Homo sapiens/Mus musculus xenograft</td>\n",
       "      <td>tissue fragment</td>\n",
       "      <td>\"1\"</td>\n",
       "      <td>Not Specified</td>\n",
       "      <td>\"Not Specified\"</td>\n",
       "      <td>\"Primary Neoplasm\"</td>\n",
       "      <td>\"LR2MY8\"</td>\n",
       "      <td>NOD.Cg-PrkdcscidIl2rgtm1Wjl/SzJ</td>\n",
       "      <td>\"57\"</td>\n",
       "      <td>\"Myxofibrosarcoma\"</td>\n",
       "      <td>\"Musculoskeletal\"</td>\n",
       "      <td>No</td>\n",
       "      <td>\"Male\"</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>513682~313-R~H30E35G36</th>\n",
       "      <td>9606</td>\n",
       "      <td>Homo sapien</td>\n",
       "      <td>human</td>\n",
       "      <td>513682~313-R~H30E35G36</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Engrafted tumor</td>\n",
       "      <td>Homo sapiens/Mus musculus xenograft</td>\n",
       "      <td>tissue fragment</td>\n",
       "      <td>\"2\"</td>\n",
       "      <td>Not Specified</td>\n",
       "      <td>\"Not Specified\"</td>\n",
       "      <td>\"Metastatic Neoplasm\"</td>\n",
       "      <td>\"H30E35G36\"</td>\n",
       "      <td>NOD.Cg-PrkdcscidIl2rgtm1Wjl/SzJ</td>\n",
       "      <td>\"67\"</td>\n",
       "      <td>\"Leiomyosarcoma\"</td>\n",
       "      <td>\"Musculoskeletal\"</td>\n",
       "      <td>No</td>\n",
       "      <td>\"Male\"</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>281475~159-R~ORIGINATOR</th>\n",
       "      <td>9606</td>\n",
       "      <td>Homo sapien</td>\n",
       "      <td>human</td>\n",
       "      <td>281475~159-R~ORIGINATOR</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Patient tumor</td>\n",
       "      <td>Homo sapiens</td>\n",
       "      <td>tissue fragment</td>\n",
       "      <td>not applicable</td>\n",
       "      <td></td>\n",
       "      <td>\"Not Specified\"</td>\n",
       "      <td>\"Primary Neoplasm\"</td>\n",
       "      <td>ORIGINATOR</td>\n",
       "      <td>NOD.Cg-PrkdcscidIl2rgtm1Wjl/SzJ</td>\n",
       "      <td>\"72\"</td>\n",
       "      <td>\"Urothelial Carcinoma\"</td>\n",
       "      <td>\"Genitourinary\"</td>\n",
       "      <td>No</td>\n",
       "      <td>\"Male\"</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>457572~356-R~ORIGINATOR</th>\n",
       "      <td>9606</td>\n",
       "      <td>Homo sapien</td>\n",
       "      <td>human</td>\n",
       "      <td>457572~356-R~ORIGINATOR</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Patient tumor</td>\n",
       "      <td>Homo sapiens</td>\n",
       "      <td>tissue fragment</td>\n",
       "      <td>not applicable</td>\n",
       "      <td></td>\n",
       "      <td>\"Not Specified\"</td>\n",
       "      <td>\"Primary Neoplasm\"</td>\n",
       "      <td>ORIGINATOR</td>\n",
       "      <td>NOD.Cg-PrkdcscidIl2rgtm1Wjl/SzJ</td>\n",
       "      <td>\"71\"</td>\n",
       "      <td>\"Gastric Adenocarcinoma\"</td>\n",
       "      <td>\"Digestive/Gastrointestinal\"</td>\n",
       "      <td>No</td>\n",
       "      <td>\"Male\"</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>555926~031-R~ORIGINATOR</th>\n",
       "      <td>9606</td>\n",
       "      <td>Homo sapien</td>\n",
       "      <td>human</td>\n",
       "      <td>555926~031-R~ORIGINATOR</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Patient tumor</td>\n",
       "      <td>Homo sapiens</td>\n",
       "      <td>tissue fragment</td>\n",
       "      <td>not applicable</td>\n",
       "      <td></td>\n",
       "      <td>\"Not Specified\"</td>\n",
       "      <td>\"Primary Neoplasm\"</td>\n",
       "      <td>ORIGINATOR</td>\n",
       "      <td>NOD.Cg-PrkdcscidIl2rgtm1Wjl/SzJ</td>\n",
       "      <td>\"59\"</td>\n",
       "      <td>\"Colon Adenocarcinoma\"</td>\n",
       "      <td>\"Digestive/Gastrointestinal\"</td>\n",
       "      <td>No</td>\n",
       "      <td>\"Female\"</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>665939~344-R~ORIGINATOR</th>\n",
       "      <td>9606</td>\n",
       "      <td>Homo sapien</td>\n",
       "      <td>human</td>\n",
       "      <td>665939~344-R~ORIGINATOR</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Patient tumor</td>\n",
       "      <td>Homo sapiens</td>\n",
       "      <td>tissue fragment</td>\n",
       "      <td>not applicable</td>\n",
       "      <td></td>\n",
       "      <td>\"Not Specified\"</td>\n",
       "      <td>\"Primary Neoplasm\"</td>\n",
       "      <td>ORIGINATOR</td>\n",
       "      <td>NOD.Cg-PrkdcscidIl2rgtm1Wjl/SzJ</td>\n",
       "      <td>\"73\"</td>\n",
       "      <td>\"Bladder Papillary Urothelial Neoplasm\"</td>\n",
       "      <td>\"Genitourinary\"</td>\n",
       "      <td>No</td>\n",
       "      <td>\"Male\"</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>439126~050-R~ORIGINATOR</th>\n",
       "      <td>9606</td>\n",
       "      <td>Homo sapien</td>\n",
       "      <td>human</td>\n",
       "      <td>439126~050-R~ORIGINATOR</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Patient tumor</td>\n",
       "      <td>Homo sapiens</td>\n",
       "      <td>tissue fragment</td>\n",
       "      <td>not applicable</td>\n",
       "      <td></td>\n",
       "      <td>\"Not Specified\"</td>\n",
       "      <td>\"Metastatic Neoplasm\"</td>\n",
       "      <td>ORIGINATOR</td>\n",
       "      <td>NOD.Cg-PrkdcscidIl2rgtm1Wjl/SzJ</td>\n",
       "      <td>\"71\"</td>\n",
       "      <td>\"Colon Adenocarcinoma\"</td>\n",
       "      <td>\"Digestive/Gastrointestinal\"</td>\n",
       "      <td>No</td>\n",
       "      <td>\"Male\"</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1495 rows × 19 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                        tax_id scientific_name common_name  \\\n",
       "sample_alias                                                 \n",
       "515863~333-R~A1PPN5       9606     Homo sapien       human   \n",
       "515863~333-R~AYW          9606     Homo sapien       human   \n",
       "918122~036-R~LR0          9606     Homo sapien       human   \n",
       "918122~036-R~LR2MY8       9606     Homo sapien       human   \n",
       "513682~313-R~H30E35G36    9606     Homo sapien       human   \n",
       "...                        ...             ...         ...   \n",
       "281475~159-R~ORIGINATOR   9606     Homo sapien       human   \n",
       "457572~356-R~ORIGINATOR   9606     Homo sapien       human   \n",
       "555926~031-R~ORIGINATOR   9606     Homo sapien       human   \n",
       "665939~344-R~ORIGINATOR   9606     Homo sapien       human   \n",
       "439126~050-R~ORIGINATOR   9606     Homo sapien       human   \n",
       "\n",
       "                                    sample_title  sample_description  \\\n",
       "sample_alias                                                           \n",
       "515863~333-R~A1PPN5          515863~333-R~A1PPN5                 NaN   \n",
       "515863~333-R~AYW                515863~333-R~AYW                 NaN   \n",
       "918122~036-R~LR0                918122~036-R~LR0                 NaN   \n",
       "918122~036-R~LR2MY8          918122~036-R~LR2MY8                 NaN   \n",
       "513682~313-R~H30E35G36    513682~313-R~H30E35G36                 NaN   \n",
       "...                                          ...                 ...   \n",
       "281475~159-R~ORIGINATOR  281475~159-R~ORIGINATOR                 NaN   \n",
       "457572~356-R~ORIGINATOR  457572~356-R~ORIGINATOR                 NaN   \n",
       "555926~031-R~ORIGINATOR  555926~031-R~ORIGINATOR                 NaN   \n",
       "665939~344-R~ORIGINATOR  665939~344-R~ORIGINATOR                 NaN   \n",
       "439126~050-R~ORIGINATOR  439126~050-R~ORIGINATOR                 NaN   \n",
       "\n",
       "                           sample origin                    sample taxon name  \\\n",
       "sample_alias                                                                    \n",
       "515863~333-R~A1PPN5      Engrafted tumor  Homo sapiens/Mus musculus xenograft   \n",
       "515863~333-R~AYW         Engrafted tumor  Homo sapiens/Mus musculus xenograft   \n",
       "918122~036-R~LR0         Engrafted tumor  Homo sapiens/Mus musculus xenograft   \n",
       "918122~036-R~LR2MY8      Engrafted tumor  Homo sapiens/Mus musculus xenograft   \n",
       "513682~313-R~H30E35G36   Engrafted tumor  Homo sapiens/Mus musculus xenograft   \n",
       "...                                  ...                                  ...   \n",
       "281475~159-R~ORIGINATOR    Patient tumor                         Homo sapiens   \n",
       "457572~356-R~ORIGINATOR    Patient tumor                         Homo sapiens   \n",
       "555926~031-R~ORIGINATOR    Patient tumor                         Homo sapiens   \n",
       "665939~344-R~ORIGINATOR    Patient tumor                         Homo sapiens   \n",
       "439126~050-R~ORIGINATOR    Patient tumor                         Homo sapiens   \n",
       "\n",
       "                         sample material engrafted tumor sample passage  \\\n",
       "sample_alias                                                              \n",
       "515863~333-R~A1PPN5      tissue fragment                            \"1\"   \n",
       "515863~333-R~AYW         tissue fragment                            \"0\"   \n",
       "918122~036-R~LR0         tissue fragment                            \"0\"   \n",
       "918122~036-R~LR2MY8      tissue fragment                            \"1\"   \n",
       "513682~313-R~H30E35G36   tissue fragment                            \"2\"   \n",
       "...                                  ...                            ...   \n",
       "281475~159-R~ORIGINATOR  tissue fragment                 not applicable   \n",
       "457572~356-R~ORIGINATOR  tissue fragment                 not applicable   \n",
       "555926~031-R~ORIGINATOR  tissue fragment                 not applicable   \n",
       "665939~344-R~ORIGINATOR  tissue fragment                 not applicable   \n",
       "439126~050-R~ORIGINATOR  tissue fragment                 not applicable   \n",
       "\n",
       "                        engrafted tumor collection site  \\\n",
       "sample_alias                                              \n",
       "515863~333-R~A1PPN5                       Not Specified   \n",
       "515863~333-R~AYW                          Not Specified   \n",
       "918122~036-R~LR0                          Not Specified   \n",
       "918122~036-R~LR2MY8                       Not Specified   \n",
       "513682~313-R~H30E35G36                    Not Specified   \n",
       "...                                                 ...   \n",
       "281475~159-R~ORIGINATOR                                   \n",
       "457572~356-R~ORIGINATOR                                   \n",
       "555926~031-R~ORIGINATOR                                   \n",
       "665939~344-R~ORIGINATOR                                   \n",
       "439126~050-R~ORIGINATOR                                   \n",
       "\n",
       "                        patient tumor site of collection  \\\n",
       "sample_alias                                               \n",
       "515863~333-R~A1PPN5                      \"Not Specified\"   \n",
       "515863~333-R~AYW                         \"Not Specified\"   \n",
       "918122~036-R~LR0                         \"Not Specified\"   \n",
       "918122~036-R~LR2MY8                      \"Not Specified\"   \n",
       "513682~313-R~H30E35G36                   \"Not Specified\"   \n",
       "...                                                  ...   \n",
       "281475~159-R~ORIGINATOR                  \"Not Specified\"   \n",
       "457572~356-R~ORIGINATOR                  \"Not Specified\"   \n",
       "555926~031-R~ORIGINATOR                  \"Not Specified\"   \n",
       "665939~344-R~ORIGINATOR                  \"Not Specified\"   \n",
       "439126~050-R~ORIGINATOR                  \"Not Specified\"   \n",
       "\n",
       "                             patient tumor type sample unique id  \\\n",
       "sample_alias                                                       \n",
       "515863~333-R~A1PPN5          \"Primary Neoplasm\"         \"A1PPN5\"   \n",
       "515863~333-R~AYW             \"Primary Neoplasm\"            \"AYW\"   \n",
       "918122~036-R~LR0             \"Primary Neoplasm\"            \"LR0\"   \n",
       "918122~036-R~LR2MY8          \"Primary Neoplasm\"         \"LR2MY8\"   \n",
       "513682~313-R~H30E35G36    \"Metastatic Neoplasm\"      \"H30E35G36\"   \n",
       "...                                         ...              ...   \n",
       "281475~159-R~ORIGINATOR      \"Primary Neoplasm\"       ORIGINATOR   \n",
       "457572~356-R~ORIGINATOR      \"Primary Neoplasm\"       ORIGINATOR   \n",
       "555926~031-R~ORIGINATOR      \"Primary Neoplasm\"       ORIGINATOR   \n",
       "665939~344-R~ORIGINATOR      \"Primary Neoplasm\"       ORIGINATOR   \n",
       "439126~050-R~ORIGINATOR   \"Metastatic Neoplasm\"       ORIGINATOR   \n",
       "\n",
       "                            engraftment host strain name  \\\n",
       "sample_alias                                               \n",
       "515863~333-R~A1PPN5      NOD.Cg-PrkdcscidIl2rgtm1Wjl/SzJ   \n",
       "515863~333-R~AYW         NOD.Cg-PrkdcscidIl2rgtm1Wjl/SzJ   \n",
       "918122~036-R~LR0         NOD.Cg-PrkdcscidIl2rgtm1Wjl/SzJ   \n",
       "918122~036-R~LR2MY8      NOD.Cg-PrkdcscidIl2rgtm1Wjl/SzJ   \n",
       "513682~313-R~H30E35G36   NOD.Cg-PrkdcscidIl2rgtm1Wjl/SzJ   \n",
       "...                                                  ...   \n",
       "281475~159-R~ORIGINATOR  NOD.Cg-PrkdcscidIl2rgtm1Wjl/SzJ   \n",
       "457572~356-R~ORIGINATOR  NOD.Cg-PrkdcscidIl2rgtm1Wjl/SzJ   \n",
       "555926~031-R~ORIGINATOR  NOD.Cg-PrkdcscidIl2rgtm1Wjl/SzJ   \n",
       "665939~344-R~ORIGINATOR  NOD.Cg-PrkdcscidIl2rgtm1Wjl/SzJ   \n",
       "439126~050-R~ORIGINATOR  NOD.Cg-PrkdcscidIl2rgtm1Wjl/SzJ   \n",
       "\n",
       "                        patient age at collection of tumor  \\\n",
       "sample_alias                                                 \n",
       "515863~333-R~A1PPN5                                   \"67\"   \n",
       "515863~333-R~AYW                                      \"67\"   \n",
       "918122~036-R~LR0                                      \"57\"   \n",
       "918122~036-R~LR2MY8                                   \"57\"   \n",
       "513682~313-R~H30E35G36                                \"67\"   \n",
       "...                                                    ...   \n",
       "281475~159-R~ORIGINATOR                               \"72\"   \n",
       "457572~356-R~ORIGINATOR                               \"71\"   \n",
       "555926~031-R~ORIGINATOR                               \"59\"   \n",
       "665939~344-R~ORIGINATOR                               \"73\"   \n",
       "439126~050-R~ORIGINATOR                               \"71\"   \n",
       "\n",
       "                        patient tumor diagnosis at time of collection  \\\n",
       "sample_alias                                                            \n",
       "515863~333-R~A1PPN5                              \"Cutaneous Melanoma\"   \n",
       "515863~333-R~AYW                                 \"Cutaneous Melanoma\"   \n",
       "918122~036-R~LR0                                   \"Myxofibrosarcoma\"   \n",
       "918122~036-R~LR2MY8                                \"Myxofibrosarcoma\"   \n",
       "513682~313-R~H30E35G36                               \"Leiomyosarcoma\"   \n",
       "...                                                               ...   \n",
       "281475~159-R~ORIGINATOR                        \"Urothelial Carcinoma\"   \n",
       "457572~356-R~ORIGINATOR                      \"Gastric Adenocarcinoma\"   \n",
       "555926~031-R~ORIGINATOR                        \"Colon Adenocarcinoma\"   \n",
       "665939~344-R~ORIGINATOR       \"Bladder Papillary Urothelial Neoplasm\"   \n",
       "439126~050-R~ORIGINATOR                        \"Colon Adenocarcinoma\"   \n",
       "\n",
       "                            patient tumor primary site  \\\n",
       "sample_alias                                             \n",
       "515863~333-R~A1PPN5                             \"Skin\"   \n",
       "515863~333-R~AYW                                \"Skin\"   \n",
       "918122~036-R~LR0                     \"Musculoskeletal\"   \n",
       "918122~036-R~LR2MY8                  \"Musculoskeletal\"   \n",
       "513682~313-R~H30E35G36               \"Musculoskeletal\"   \n",
       "...                                                ...   \n",
       "281475~159-R~ORIGINATOR                \"Genitourinary\"   \n",
       "457572~356-R~ORIGINATOR   \"Digestive/Gastrointestinal\"   \n",
       "555926~031-R~ORIGINATOR   \"Digestive/Gastrointestinal\"   \n",
       "665939~344-R~ORIGINATOR                \"Genitourinary\"   \n",
       "439126~050-R~ORIGINATOR   \"Digestive/Gastrointestinal\"   \n",
       "\n",
       "                        was the pdx model humanised? patient sex  \n",
       "sample_alias                                                      \n",
       "515863~333-R~A1PPN5                               No      \"Male\"  \n",
       "515863~333-R~AYW                                  No      \"Male\"  \n",
       "918122~036-R~LR0                                  No      \"Male\"  \n",
       "918122~036-R~LR2MY8                               No      \"Male\"  \n",
       "513682~313-R~H30E35G36                            No      \"Male\"  \n",
       "...                                              ...         ...  \n",
       "281475~159-R~ORIGINATOR                           No      \"Male\"  \n",
       "457572~356-R~ORIGINATOR                           No      \"Male\"  \n",
       "555926~031-R~ORIGINATOR                           No    \"Female\"  \n",
       "665939~344-R~ORIGINATOR                           No      \"Male\"  \n",
       "439126~050-R~ORIGINATOR                           No      \"Male\"  \n",
       "\n",
       "[1495 rows x 19 columns]"
      ]
     },
     "execution_count": 144,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "buildEnaSampleSubmissionFile(psDf, xenoDf, fqDf, ena)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 145,
   "metadata": {},
   "outputs": [],
   "source": [
    "rnaMetadata = ps.read_csv('./currentSubmission/matchFastqs.tsv', sep='\\t')\n",
    "sampleAcc = ps.read_csv('sampleAccessions', sep='\\t', names=['type', 'accession1', 'sample_alias'], header=None)\n",
    "allSampleMetadata = ps.read_csv('./currentSubmission/completedEnaAllSamplesMetadata.tsv', sep='\\t')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 146,
   "metadata": {},
   "outputs": [],
   "source": [
    "missedSampleMetadata = rnaMetadata[~rnaMetadata.sample_alias.isin(sampleAcc.sample_alias)]\n",
    "missedMetadata = allSampleMetadata[allSampleMetadata.sample_alias.isin(missedSampleMetadata.sample_alias)].set_index('sample_alias')\n",
    "missedMetadata.iloc[:,12:].to_csv('missingRnaSampleMetadata.tsv', sep='\\t')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 147,
   "metadata": {},
   "outputs": [],
   "source": [
    "%%bash\n",
    "cat enaSampleTemplate.csv <(tail -n +2 missingRnaSampleMetadata.tsv) > completedRnaSampleMetadata.tsv\n",
    "sed -i 's/\"//g' completedRnaSampleMetadata.tsv\n",
    "sed -i $'s/\\t /\\t/g' completedRnaSampleMetadata.tsv"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 148,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "cat: headers: No such file or directory\n",
      "cat: headers: No such file or directory\n",
      "cat: headers: No such file or directory\n",
      "cat: headers: No such file or directory\n",
      "cat: headers: No such file or directory\n"
     ]
    }
   ],
   "source": [
    "%%bash\n",
    "cd currentSubmission\n",
    "head -n 1 matchFastqs.tsv > fastqHeaders\n",
    "tail -n +2 completedEnaAllSamplesMetadata.tsv > headerlessData\n",
    "uniq -w 100 headerlessData > uniqHeaderlessData\n",
    "tail -n +2 matchFastqs.tsv > headerlessFsData\n",
    "split -l 200 -d uniqHeaderlessData sampleData\n",
    "split -l 200 -d headerlessFsData fqData\n",
    "for i in sampleData* ; do cat headers \"$i\" > \"$i\".tsv; done;\n",
    "for i in fqData* ; do cat fastqHeaders \"$i\" > \"$i\".tsv; done;\n",
    "rm fqData??\n",
    "rm sampleData??"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
